"AU Direct Debit" = "Addebito diretto AU";

"Affirm" = "Affirm";

"Afterpay" = "Afterpay";

"Alipay" = "Alipay";

"BLIK" = "BLIK";

"Bacs Direct Debit" = "Addebito diretto Bacs";

"Bancontact" = "Bancontact";

"Boleto" = "Boleto";

"Card" = "Carta";

"Cash App Pay" = "Cash App Pay";

"Clearpay" = "Clearpay";

"EPS" = "EPS";

"FPX" = "FPX";

"GrabPay" = "GrabPay";

"Klarna" = "Klarna";

"Konbini" = "Konbini";

"Link" = "Link";

"NetBanking" = "Banca online";

"OXXO" = "OXXO";

"PayPal" = "PayPal";

"Przelewy24" = "Przelewy24";

"SEPA Debit" = "Addebito SEPA";

"Sofort" = "Sofort";

"Swish" = "Swish";

"Timed out authenticating your payment method -- try again" = "Timeout durante l'autenticazione del metodo di pagamento. Riprova.";

"UPI" = "UPI";

"US bank account" = "Conto bancario Stati Uniti";

"Unknown" = "Sconosciuto";

"We are unable to authenticate your payment method. Please choose a different payment method and try again." = "Impossibile autenticare il metodo di pagamento. Scegline un altro e riprova.";

"WeChat Pay" = "WeChat Pay";

"giropay" = "giropay";

"iDEAL" = "iDEAL";
